# Handling Missing Values

In [43]:
import pandas as pd

df = pd.read_csv('datasets/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Age,Boarded,Destination,Class
0,1,0,3,male,1,0,22.0,Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",3
1,2,1,1,female,1,0,35.0,Cherbourg,"New York, New York, US",1
2,3,1,3,female,0,0,26.0,Southampton,New York City,3
3,4,1,1,female,1,0,35.0,Southampton,"Scituate, Massachusetts, US",1
4,5,0,3,male,0,0,35.0,Southampton,New York City,3

In [ ]:
df.describe()

In [ ]:
# df.info()


# Dropping rows with missing values
df.isnull()

In [ ]:
# Dropping columns with missing values
df.dropna(axis=1)

In [ ]:
# Filling missing values with a specific value
value = 0
df.fillna(value)

In [ ]:
# Filling missing values with the mean of the column
df.fillna(df.mean())

# Handling Duplicates

In [ ]:
# Checking for duplicate values
df.duplicated()

In [ ]:
# Counting duplicate values
df.duplicated().sum()

In [ ]:
# Dropping duplicates based on specific columns
df.drop_duplicates(subset=['Boarded', 'Parch'])

In [ ]:
# Dropping duplicate rows
df.drop_duplicates()

# Handling inconsistent Data

In [ ]:
# Converting string column to lowercase

# df['column'] = df['column'].str.lower()
df['Boarded'] = df['Boarded'].str.lower()

df.head()

In [ ]:
# Removing leading and trailing whitespace

# df['column'] = df['column'].str.strip()
df['Destination_clean'] = df['Destination'].str.strip()

df.head()

In [46]:

# Replacing inconsistent values with a specific value

# df['column'].replace({'value1': 'new_value1', 'value2': 'new_value2'}, inplace=True)
# df['Boarded'].replace({'cherbourg': 'cherbourg_city', 'southampton': 'chelsea'}, inplace=True)

# df.to_excel("titanic_xls.xls")
df.to_csv("t_csv.csv")